Repository: Daniel-KM/Omeka-S-module-CustomOntology
Catalog: language/*.po
Languages: fr

source: A new button was added in main menu "Vocabularies".
fr: Un nouveau bouton a été ajouté au menu principal « Vocabulaires ».

source: Create a vocabulary
fr: Créer un vocabulaire

source: Error: unknown vocabulary for "%1$s" "%2$s".
fr: Erreur : vocabulaire inconnu pour "%1$s" "%2$s".

source: Create a custom ontology
fr: Créer une ontologie personnalisée

source: To create an ontology, classes and/or properties, fill the appropriate following fields.
fr: Pour créer une ontologie, des classes ou des propriétés, remplissez les champs suivants.

source: The next three forms are independant, and can be used together (for a new ontology) or separately (to add new elements to an existing ontology).
fr: Les trois champs suivants sont indépendants et peuvent être utilisés ensemble (pour créer une nouvelle ontologie) ou séparément (pour ajouter de nouveaux éléments à une ontologie existante).

source: Once filled, click "Submit" to import the ontology or the new classes or properties directly in Omeka S.
fr: Une fois rempli, cliquez sur « Soumettre » pour importer l’ontologie ou les nouvelles classes ou propriétés directement dans Omeka S.

source: You may also click "Get turtle" below to get the %1$sTurtle%3$s formatted ontology, if wanted, and import it yourself via the page %2$sImport vocabulary%3$s.
fr: Vous pouvez également cliquer sur "Télécharger le fichier turtle" en bas pour récupérer l’ontologie au format %1$sturtle%3$s, si besoin, et l’importer vous-même via la page %2$sImporter un vocabulaire%3$s.

source: The ontologies that use the proposed namespace uri are available as human and as turtle publicly %1$shere%2$s.
fr: Les ontologies qui utilisent l'espace de nom proposé sont disponible en version lisible et en fichier turtle publiquement %1$sici%2$s.

source: Warning:
fr: Attention :

source: After checks, there is no possibility to correct data here, but only to add new elements.
fr: Après vérification, les données ne peuvent pas être corrigées ici et il est seulement possible d’ajouter de nouveaux éléments.

source: Nevertheless, the vocabularies can be managed like any other %1$svocabularies%2$s via the turtle files, that are editable via any standard true text editor.
fr: Néanmoins, les vocabulaires peuvent être gérés comme tous les autres dans la page des %1$svocabulaires%2$s via les fichiers turtle, qui sont éditables par tout éditeur de texte standard.

source: Create a specific ontology
fr: Créer une ontologie spécifique

source: An ontology must have a namespace uri and a unique lowercase prefix.
fr: Une ontologie doit avoir une uri d’espace de nom et un préfixe unique en minuscules.

source: It is recommended to use the default namespace uri with the prefix, so it will be possible to publish the ontology automatically.
fr: Il est recommandé d’utiliser l’espace de nom par défaut avec le préfixe afin de rendre public l’ontologie automatiquement.

source: It is recommended to end it with a "/" or a "#", so classes and properties will have their own uri, for example %s.
fr: Il est recommandé de terminer l’uri d’espace de nom avec un "/" ou un "#" afin que les classes et les propriétés puissent avoir leur propre uri, par exemple %s.

source: The format can be a %scool uri%s or a %spersistent url%s.
fr: Le format peut être une %scool uri%s ou une %surl pérenne%s.

source: It can contain a date or a version.
fr: Il peut contenir une date ou une version.

source: A label is required too, and a description can be added.
fr: Un libellé est nécessaire et une description peut être ajoutée.

source: Create specific classes
fr: Créer des classes spécifiques

source: A class must be formatted with a prefix and a title-case local name, like "dctype:PhysicalObject".
fr: Une classe doit être formatée avec un préfixe et un nom local en casse de titre, comme "dctype:PhysicalObject".

source: Multiple classes can be created, one by row.
fr: De multiples classes peuvent être créées, une par ligne.

source: Create specific properties
fr: Créer des propriétés spécifiques

source: A property must be formatted with a prefix and a camel-case local name, like "dcterms:isPartOf".
fr: Une propriété doit être formatée avec un préfixe et un nom local en casse "chameau", comme "dcterms:isPartOf".

source: Multiple properties can be created, one by row.
fr: De multiples propriétés peuvent être créées, une par ligne.

source: Existing classes or properties will be skipped, so you can copy paste a full list.
fr: Les classes ou les propriétés existantes seront ignorées et vous pouvez donc copier-coller une liste complète.

source: The label is the string that follows the term, separated by a ",".
fr: Le libellé est la chaîne qui suit le terme, séparé d"une ",".

source: The comment is the string that follows the label, separated by a ",".
fr: Le commentaire est la chaîne qui suit le libellé, séparé par une ",".

source: It is not recommended to create new classes or properties inside standard ontologies: use only your own prefixes.
fr: Il n’est pas recommandé d’ajouter des classes ou des propriétés dans les ontologies existantes, mais d’utiliser vos propres préfixes.

source: Get turtle (no save)
fr: Télécharger le fichier turtle (sans enregistrer)

source: List of custom ontologies
fr: Liste des vocabulaires personnalisés

source: There are no custom ontology.
fr: Il n’y a pas d’ontologie personnalisée.

source: Namespace uri: %s
fr: Uri de l’espace de nom : %s

source: Recommended prefix: %s
fr: Préfixe recommandé : %s

source: %1$shuman%2$s | %3$sturtle%2$s | %4$sjson-ld%2$s | %5$sn3%2$s | %6$sn-triples%2$s | %7$srdf-xml%2$s
fr: %1$slisible%2$s | %3$sturtle%2$s | %4$sjson-ld%2$s | %5$sn3%2$s | %6$sn-triples%2$s | %7$srdf-xml%2$s

source: HTTP Content-Negociation is supported.
fr: Le « HTTP Content-Negociation » est prise en charge.

source: There are no classes.
fr: Il n’y a pas de classe.

source: There are no properties.
fr: Il n’y a pas de propriétés.

source: Ontology
fr: Ontologie

source: Namespace uri
fr: Uri d’espace de nom

source: myprefix
fr: monprefixe

source: My label
fr: Mon libellé

source: A specific ontology for my documents.
fr: Une ontologie spécifique pour mes documents.

source: myprefix:MySpecificClass, My specific class, A resource class to use for my specific documents.
fr: monprefixe:MaClasseSpecifique, Ma classe spécifique, Une classe de ressource à utiliser pour mes documents spécifiques.

source: myprefix:mySpecificProperty, My specific property, A property to use for my specific documents.
fr: monprefixe:maProprieteSpecifique, Ma propriété spécifique, Une propriété à utiliser pour mes documents spécifiques.

source: An error was found. Turtle cannot be created. Nothing was imported.
fr: Une erreur a été trouvée. Le turtle n’a pas pu être créé. Rien n’a été importé.

source: Nothing to process.
fr: Rien à traiter.

source: Unable to create the ontology.
fr: Impossible de créer l’ontologie.

source: The vocabulary "%1$s" (%2$s) has been created (%3$sapi%4$s).
fr: Le vocabulaire "%1$s" (%2$s) a été créé (%3$sapi%4$s).

source: %d resource classes have been created: %s.
fr: %d classes de ressource ont été créées : %s.

source: %d properties have been created: %s.
fr: %d propriétés ont été créées : %s.

source: A namespace uri is set for the ontology, but there is no prefix.
fr: Une uri d’espace de nom est indiquée pour cette ontologie, mais aucun préfixe.

source: A prefix is set for the ontology, but there is no namespace uri.
fr: Un préfixe est insiqué pour cette ontologie, mais aucune uri d’espace de nom.

source: The prefix of the ontology must be lowercase.
fr: Le préfixe de l’ontologie doit être en minuscule.

source: The prefix must start with an alphabetic character and must contain only alphanumeric characters.
fr: Le préfixe doit commencer avec une lettre et doit contenir uniquement des caractères alphanumériques.

source: A label is required for the ontology.
fr: Un libellé est nécessaire pour l’ontologie.

source: An ontology exists for the prefix "%s".
fr: Une ontologie existe déjà pour le préfixe "%s".

source: An ontology exists for the namespace uri "%s".
fr: Une ontologie existe déjà pour l’espace de nom "%s".

source: Resource classes
fr: Classes de resource

source: %s, row #%d
fr: %s, ligne #%d

source: %s: A content is defined, but no term.
fr: %s : un contenu est défini, mais sans terme.

source: %s: The term must be formatted "prefix:LocalName".
fr: %s : le terme doit être formaté "prefixe:NomLocal".

source: %s: The term must be formatted "prefix:localName".
fr: %s : le terme doit être formaté "prefixe:nomLocal".

source: %s: The local name part of the term "%s" must start with a upper-case letter.
fr: %s : la partie nom local du terme "%s" doit commencer par une majuscule.

source: %s: The local name part of the term "%s" must start with a lower-case letter.
fr: %s : la partie nom local du terme "%s" doit commencer par une minuscule.

source: %s: The term "%s" must start with an alphabetic character and contain only alphanumeric characters, "-" and "_".
fr: %s : le terme "%s" doit commencer avec un caractère alphabétique et contenir uniquement des caractères alphanumériques, "-" et "_".

source: %s: No ontology exists for prefix "%s".
fr: %s : aucun ontologie n’existe pour le préfixe "%s".

source: %s: For standardization purpose, this tool forbids to add a term to the default Dublin Core vocabularies "%s".
fr: %s : pour des raisons de normalisation, cet outil interdit d’ajouter des termes au vocabulaire par défaut Dublin Core "%s".

source: %s: The term "%s" exists and is skipped.
fr: %s : le terme "%s" existe et a été ignoré.

source: %s: The prefix "%s" is reserved by Omeka.
fr: %s : le préfixe "%s" est réservé par Omeka.

source: %s: The term "%s" must have a label.
fr: %s : le terme "%s" doit avoir un libellé.

source: %s: The term "%s" is already specified above, row #%d.
fr: %s : le terme "%s" est déjà spécifié ci-dessus, ligne #%d.

source: %s: The label "%s" is already used above, row #%d.
fr: %s : le libellé "%s" est déjà spécifié ci-dessus, ligne #%d.

source: An issue occurred when saving the ontology.
fr: Un problème est survenu lors de l’enregistrement de l’ontologie.

source: Custom ontology
fr: Ontologie personnalisée
